#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <time.h>

void main()
{
	setlocale(LC_ALL, "Rus");
	
	int question=0;
	printf("хотите стать профессиональным музыкантом (1 - да, любое число - нет)? ");
	scanf("%d", &question);

	if (question==1)
	{
		int q1 = 0;
		printf("вы богаты (1 - да, любое число - нет)? ");
		scanf("%d", &q1);

		if (q1==1)
		{
			int q11 = 0;
			st1:
			printf("любите отрыватьс€ (1 - да, любое число - нет)? ");
			scanf("%d", &q11);

			if (q11==1)
			{
				int q111 = 0;
				printf("пиво пьете (1 - да, любое число - нет)? ");
				scanf("%d", &q111);

				if (q111==1)
				{
					int q1111 = 0;
					printf("хотите играть классику (1 - да, 0 - нет, любое число - не знаю)? ");
					scanf("%d", &q1111);

					if (q1111 == 1)
					{
						int q11111 = 0;
						printf("готовы работать круглые сутки (1 - да, любое число - нет)? ");
						scanf("%d", &q11111);

						if (q11111 == 1)
							printf("√ќЅќ…\n");
						else
						{
							int q111110 = 0;
							printf("готовы к тому, что будут проблемы с работой, даже если вы круто играете (1 - да, любое число - нет)? ");
							scanf("%d", &q111110);

							if (q111110 == 1)
								printf(" Ћј–Ќ≈“\n");
							else
								printf("¬јЋ“ќ–Ќј\n");
						}
					}
					else if (q1111 == 0)
					{
						int q11110 = 0;
						printf("... а джаз (1 - да, любое число - нет)? ");
						scanf("%d", &q11110);

						if (q11110 == 1)
							printf("—ј —ќ‘ќЌ\n");
						else
						{
							int q111100 = 0;
							printf("у вас есть немецкие корни (1 - да, любое число - нет)? ");
							scanf("%d", &q111100);

							if (q111100 == 1)
								printf("“–”Ѕј\n");
							else
								printf("ƒ”ƒ” \n");
						}
					}
					else
						printf("“–ќћЅќЌ\n");
				}
				else
				{
					int q1110 = 0;
					printf("вы страсна€ натура (1 - да, любое число - нет)? ");
					scanf("%d", &q1110);

					if (q1110 == 1)
						printf("¬»ќЋќЌ„≈Ћ№\n");
					else
						printf("ƒќћЅ–ј\n");
				}
			}
			else
			{
				int q110 = 0;
				printf("готовы заниматьс€ по 8 часов в день (1 - да, любое число - нет)? ");
				scanf("%d", &q110);

				if (q110==1)
				{
					int q1101 = 0;
					printf("хотите учить детей (1 - да, любое число - нет)? ");
					scanf("%d", &q1101);

					if (q1101 == 1)
						printf("‘Ћ≈…“ј\n");
					else
						printf("— –»ѕ ј\n");
				}
				else
				{
					int q1100 = 0;
					printf("ноты знаете (1 - да, любое число - нет)? ");
					scanf("%d", &q1100);

					if (q1100 == 1)
						printf("ј–‘ј\n");
					else
						printf("јЋ№“\n");
				}
			}
		}
		else
		{
			int q10 = 0;
			printf("любите деньги (1 - да, любое число - нет)? ");
			scanf("%d", &q10);

			if (q10 == 1)
				printf("«абудьте о музыке!!\n");
			else
				goto st1;
		}
	}
	else
	{
		int q0 = 0;
		printf("хотите встречатьс€ с девушками (1 - да, любое число - нет)? ");
		scanf("%d", &q0);

		if (q0==1)
		{
			int q01 = 0;
			printf("любите глупышек (1 - да, любое число - нет)? ");
			scanf("%d", &q01);

			if (q01==1)
			{
				int q011 = 0;
				printf("любите выпить (1 - да, любое число - нет)? ");
				scanf("%d", &q011);

				if (q011 == 1)
					printf("√»“ј–ј\n");
				else
					printf("‘ќ–“≈ѕ»јЌќ\n");
			}
			else
			{
				int q010 = 0;
				st2:
				printf("вы парень (1 - да, любое число - нет)? ");
				scanf("%d", &q010);

				if (q010 == 1)
					printf("ќѕ≈–Ќџ… ѕ≈¬≈÷\n");
				else
					printf("”ƒј–Ќџ≈\n");
			}
		}
		else
		{
			int q00 = 0;
			printf("хотите встречатьс€ с парн€ми (1 - да, любое число - нет)? ");
			scanf("%d", &q00);

			if (q00 == 1)
				goto st2;
			else
				printf("‘ј√ќ“\n");			
		}
	}

}